goessl/ATmega328P/NRF24L01.c
/*
 * NRF24L01.c
 * 
 * Author:      Sebastian Gössl
 * Hardware:    ATmega328P, NRF24L01+
 * 
 * LICENSE:
 * MIT License
 * 
 * Copyright (c) 2019 Sebastian Gössl
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */



#include <avr/interrupt.h>
#include <util/delay.h>
#include <string.h>
#include "SPI.h"
#include "NRF24L01.h"



#if NRF24L01_INTERRUPT == 0
    #define NRF24L01_vect INT0_vect
#elif NRF24L01_INTERRUPT == 1
    #define NRF24L01_vect INT1_vect
#else
    #error "No valid NRF24L01_INTERRUPT selected!"
#endif


//Commands
#define NRF24L01_CMD_R_REGISTER(x)      (x & 0x1F)
#define NRF24L01_CMD_W_REGISTER(x)      ((x & 0x1F) | 0x20)
#define NRF24L01_CMD_R_RX_PAYLOAD       0x61
#define NRF24L01_CMD_W_TX_PAYLOAD       0xA0
#define NRF24L01_CMD_FLUSH_TX           0xE1
#define NRF24L01_CMD_FLUSH_RX           0xE2
#define NRF24L01_CMD_REUSE_TX_PL        0xE3
#define NRF24L01_CMD_R_RX_PL_WID        0x60
#define NRF24L01_CMD_W_ACK_PAYLOAD(p)   (0xA8 | (p & 0x07))
#define NRF24L01_CMD_W_TX_PAYLOAD_NOACK 0xB0
#define NRF24L01_CMD_ACTIVATE           0x50
#define NRF24L01_CMD_ACTIVATE_DATA      0x73
#define NRF24L01_CMD_NOP                0xFF

//Registers
//Config
#define NRF24L01_RA_CONFIG          0x00
#define NRF24L01_BIT_MASK_RX_DR     6
#define NRF24L01_BIT_MASK_TX_DS     5
#define NRF24L01_BIT_MASK_MAX_RT    4
#define NRF24L01_BIT_EN_CRC         3
#define NRF24L01_BIT_CRCO           2
#define NRF24L01_BIT_PWR_UP         1
#define NRF24L01_BIT_PRIM_RX        0
//Enable auto acknowledge
#define NRF24L01_RA_EN_AA           0x01
#define NRF24L01_BIT_ENAA_P5        5
#define NRF24L01_BIT_ENAA_P4        4
#define NRF24L01_BIT_ENAA_P3        3
#define NRF24L01_BIT_ENAA_P2        2
#define NRF24L01_BIT_ENAA_P1        1
#define NRF24L01_BIT_ENAA_P0        0
#define NRF24L01_BIT_ENAA_P(pipe)   (NRF24L01_BIT_ENAA_P0 + pipe)
//Enable RX pipe
#define NRF24L01_RA_EN_RXADDR       0x02
#define NRF24L01_BIT_ERX_P5         5
#define NRF24L01_BIT_ERX_P4         4
#define NRF24L01_BIT_ERX_P3         3
#define NRF24L01_BIT_ERX_P2         2
#define NRF24L01_BIT_ERX_P1         1
#define NRF24L01_BIT_ERX_P0         0
#define NRF24L01_BIT_ERX_P(pipe)    (NRF24L01_BIT_ERX_P0 + pipe)
//Setup address width
#define NRF24L01_RA_SETUP_AW        0x03
#define NRF24L01_BIT_AW             0
#define NRF24L01_LEN_AW             2
//Setup retries
#define NRF24L01_RA_SETUP_RETR      0x04
#define NRF24L01_BIT_ARD            4
#define NRF24L01_LEN_ARD            4
#define NRF24L01_BIT_ARC            0
#define NRF24L01_LEN_ARC            4
//RF Channel
#define NRF24L01_RA_RF_CH           0x05
#define NRF24L01_BIT_RF_CH          0
#define NRF24L01_LEN_RF_CH          7
//RF Setup
#define NRF24L01_RA_RF_SETUP        0x06
#define NRF24L01_BIT_CONT_WAVE      7
#define NRF24L01_BIT_RF_DR_LOW      5
#define NRF24L01_BIT_PLL_LOCK       4
#define NRF24L01_BIT_RF_DR_HIGH     3
#define NRF24L01_BIT_RF_PWR         1
#define NRF24L01_LEN_RF_PWR         2
//Status
#define NRF24L01_RA_STATUS          0x07
#define NRF24L01_BIT_RX_DR          6
#define NRF24L01_BIT_TX_DS          5
#define NRF24L01_BIT_MAX_RT         4
#define NRF24L01_BIT_RX_P_NO        1
#define NRF24L01_LEN_RX_P_NO        3
#define NRF24L01_BIT_STATUS_TX_FULL 0
//Observe TX
#define NRF24L01_RA_OBSERVE_TX      0x08
#define NRF24L01_BIT_PLOS_CNT       4
#define NRF24L01_LEN_PLOS_CNT       4
#define NRF24L01_BIT_ARC_CNT        0
#define NRF24L01_LEN_ARC_CNT        4
//Received power detector
#define NRF24L01_RA_RPD             0x09
#define NRF24L01_BIT_RPD            0
//RX addresses
#define NRF24L01_RA_RX_ADDR_P0      0x0A
#define NRF24L01_RA_RX_ADDR_P1      0x0B
#define NRF24L01_RA_RX_ADDR_P2      0x0C
#define NRF24L01_RA_RX_ADDR_P3      0x0D
#define NRF24L01_RA_RX_ADDR_P4      0x0E
#define NRF24L01_RA_RX_ADDR_P5      0x0F
#define NRF24L01_RA_RX_ADDR_P(pipe) (NRF24L01_RA_RX_ADDR_P0 + pipe)
#define NRF24L01_RA_RX_ADDR_P0_LEN  5
#define NRF24L01_RA_RX_ADDR_P1_LEN  5
#define NRF24L01_RA_RX_ADDR_P2_LEN  1
#define NRF24L01_RA_RX_ADDR_P3_LEN  1
#define NRF24L01_RA_RX_ADDR_P4_LEN  1
#define NRF24L01_RA_RX_ADDR_P4_LEN  1
#define NRF24L01_RA_RX_ADDR_P_LEN(pipe) ((pipe == 0 || pipe == 1)?5:1)
//TX address
#define NRF24L01_RA_TX_ADDR         0x10
#define NRF24L01_RA_TX_ADDR_LEN     5
//Payload widths
#define NRF24L01_RA_RX_PW_P0        0x11
#define NRF24L01_RA_RX_PW_P1        0x12
#define NRF24L01_RA_RX_PW_P2        0x13
#define NRF24L01_RA_RX_PW_P3        0x14
#define NRF24L01_RA_RX_PW_P4        0x15
#define NRF24L01_RA_RX_PW_P5        0x16
#define NRF24L01_RA_RX_PW_P(pipe)   (NRF24L01_RA_RX_PW_P0 + pipe)
#define NRF24L01_BIT_RX_PW_P        0
#define NRF24L01_LEN_RX_PW_P        6
//FIFO status
#define NRF24L01_RA_FIFO_STATUS     0x17
#define NRF24L01_BIT_TX_REUSE       6
#define NRF24L01_BIT_FIFO_TX_FULL   5
#define NRF24L01_BIT_TX_EMPTY       4
#define NRF24L01_BIT_RX_FULL        1
#define NRF24L01_BIT_RX_EMPTY       0
//Dynamic payload
#define NRF24L01_RA_DYNPD           0x1C
#define NRF24L01_BIT_DPL_P5         5
#define NRF24L01_BIT_DPL_P4         4
#define NRF24L01_BIT_DPL_P3         3
#define NRF24L01_BIT_DPL_P2         2
#define NRF24L01_BIT_DPL_P1         1
#define NRF24L01_BIT_DPL_P0         0
#define NRF24L01_BIT_DPL_P(pipe)    (NRF24L01_BIT_DPL_P0 + pipe)
//Feature
#define NRF24L01_RA_FEATURE         0x1D
#define NRF24L01_BIT_EN_DPL         2
#define NRF24L01_BIT_EN_ACK_PAY     1
#define NRF24L01_BIT_EN_DYN_ACK     0



static volatile uint8_t* NRF24L01_csnPORT;
static volatile uint8_t NRF24L01_csnPin;
static volatile uint8_t* NRF24L01_cePORT;
static volatile uint8_t NRF24L01_cePin;

static volatile uint8_t NRF24L01_rxData[NRF24L01_MAX_PAYLOAD];
static volatile uint8_t NRF24L01_rxLen = 0;
static volatile uint8_t NRF24L01_txStatus = NRF24L01_TX_STATUS_BUSY;



static void NRF24L01_setCSN(bool value)
{
    if(value)
        *NRF24L01_csnPORT |= (1 << NRF24L01_csnPin);
    else
        *NRF24L01_csnPORT &= ~(1 << NRF24L01_csnPin);
}

static void NRF24L01_setCE(bool value)
{
    if(value)
        *NRF24L01_cePORT |= (1 << NRF24L01_cePin);
    else
        *NRF24L01_cePORT &= ~(1 << NRF24L01_cePin);
}


//Commands
static uint8_t NRF24L01_command(uint8_t cmd, uint8_t* data, size_t len)
{
    uint8_t status;
    
    
    NRF24L01_setCSN(false);
    
    status = SPI_transmit(cmd);
    SPI_transmitBurst(data, data, len);
    
